---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationServiceParam
source: html/6e040817-cefd-42e5-96a5-ebdee59c443a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationServiceParam Property

"Fabrication Service"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationServiceParam { get; }
```